{
  "model_type": "fela-moderation",
  "library_name": "transformers",
  "architectures": ["FelaModeratorForSequenceClassification"],
  "auto_map": {
    "AutoConfig": "configuration_moderation.FelaModeratorConfig",
    "AutoModelForSequenceClassification": "modeling_moderation.FelaModeratorForSequenceClassification"
  },
  "arch": "FELAModerationV2",
  "note": "byte level FNO+GLA moderation and PII model, 18.9M params, vocab 259; seven heads on one shared encoder: 19 way taxonomy, 6 way Jigsaw toxicity, per token PII BIO (113 tags, 56 entity types), plus spam, jailbreak, nsfw, and identity.",
  "vocab_size": 259,
  "max_len": 512,
  "d_model": 448,
  "n_layers": 8,
  "n_heads": 7,
  "fno_modes": 128,
  "gla_chunk": 32,
  "ffn_hidden": 1280,
  "layer_pattern": "SSSL",
  "dropout": 0.1,
  "pad_id": 256,
  "cls_id": 257,
  "sep_id": 258,
  "n_tox_labels": 6,
  "n_pii_tags": 113,
  "jigsaw_labels": ["toxic", "severe_toxic", "obscene", "threat", "insult", "identity_hate"],
  "spam_labels": ["spam", "scam", "phishing"],
  "pii_entity_types": [
    "PERSON",
    "FIRSTNAME",
    "LASTNAME",
    "USERNAME",
    "EMAIL",
    "PHONE",
    "FAX",
    "STREET_ADDRESS",
    "CITY",
    "STATE",
    "ZIPCODE",
    "COUNTRY",
    "BUILDINGNUMBER",
    "SECONDARYADDRESS",
    "NEARBYGPSCOORDINATE",
    "DOB",
    "AGE",
    "SSN",
    "PASSPORT",
    "DRIVERLICENSE",
    "IDCARD",
    "CREDITCARD",
    "CREDITCARDCVV",
    "CREDITCARDEXP",
    "IBAN",
    "BIC_SWIFT",
    "ACCOUNTNUMBER",
    "ROUTINGNUMBER",
    "BITCOINADDRESS",
    "ETHEREUMADDRESS",
    "IPV4",
    "IPV6",
    "MACADDRESS",
    "URL",
    "USERAGENT",
    "COMPANYNAME",
    "JOBTITLE",
    "MRN",
    "MEDICALLICENSE",
    "HEALTHINSURANCEID",
    "VEHICLEVIN",
    "VEHICLEPLATE",
    "TIME",
    "DATE",
    "PIN",
    "PASSWORD",
    "APIKEY",
    "ORDINALDIRECTION",
    "CURRENCY",
    "AMOUNT",
    "GENDER",
    "ETHNICITY",
    "RELIGION",
    "SEXUALITY",
    "POLITICAL",
    "MARITALSTATUS"
  ],
  "pii_tags": [
    "O",
    "B-PERSON",
    "I-PERSON",
    "B-FIRSTNAME",
    "I-FIRSTNAME",
    "B-LASTNAME",
    "I-LASTNAME",
    "B-USERNAME",
    "I-USERNAME",
    "B-EMAIL",
    "I-EMAIL",
    "B-PHONE",
    "I-PHONE",
    "B-FAX",
    "I-FAX",
    "B-STREET_ADDRESS",
    "I-STREET_ADDRESS",
    "B-CITY",
    "I-CITY",
    "B-STATE",
    "I-STATE",
    "B-ZIPCODE",
    "I-ZIPCODE",
    "B-COUNTRY",
    "I-COUNTRY",
    "B-BUILDINGNUMBER",
    "I-BUILDINGNUMBER",
    "B-SECONDARYADDRESS",
    "I-SECONDARYADDRESS",
    "B-NEARBYGPSCOORDINATE",
    "I-NEARBYGPSCOORDINATE",
    "B-DOB",
    "I-DOB",
    "B-AGE",
    "I-AGE",
    "B-SSN",
    "I-SSN",
    "B-PASSPORT",
    "I-PASSPORT",
    "B-DRIVERLICENSE",
    "I-DRIVERLICENSE",
    "B-IDCARD",
    "I-IDCARD",
    "B-CREDITCARD",
    "I-CREDITCARD",
    "B-CREDITCARDCVV",
    "I-CREDITCARDCVV",
    "B-CREDITCARDEXP",
    "I-CREDITCARDEXP",
    "B-IBAN",
    "I-IBAN",
    "B-BIC_SWIFT",
    "I-BIC_SWIFT",
    "B-ACCOUNTNUMBER",
    "I-ACCOUNTNUMBER",
    "B-ROUTINGNUMBER",
    "I-ROUTINGNUMBER",
    "B-BITCOINADDRESS",
    "I-BITCOINADDRESS",
    "B-ETHEREUMADDRESS",
    "I-ETHEREUMADDRESS",
    "B-IPV4",
    "I-IPV4",
    "B-IPV6",
    "I-IPV6",
    "B-MACADDRESS",
    "I-MACADDRESS",
    "B-URL",
    "I-URL",
    "B-USERAGENT",
    "I-USERAGENT",
    "B-COMPANYNAME",
    "I-COMPANYNAME",
    "B-JOBTITLE",
    "I-JOBTITLE",
    "B-MRN",
    "I-MRN",
    "B-MEDICALLICENSE",
    "I-MEDICALLICENSE",
    "B-HEALTHINSURANCEID",
    "I-HEALTHINSURANCEID",
    "B-VEHICLEVIN",
    "I-VEHICLEVIN",
    "B-VEHICLEPLATE",
    "I-VEHICLEPLATE",
    "B-TIME",
    "I-TIME",
    "B-DATE",
    "I-DATE",
    "B-PIN",
    "I-PIN",
    "B-PASSWORD",
    "I-PASSWORD",
    "B-APIKEY",
    "I-APIKEY",
    "B-ORDINALDIRECTION",
    "I-ORDINALDIRECTION",
    "B-CURRENCY",
    "I-CURRENCY",
    "B-AMOUNT",
    "I-AMOUNT",
    "B-GENDER",
    "I-GENDER",
    "B-ETHNICITY",
    "I-ETHNICITY",
    "B-RELIGION",
    "I-RELIGION",
    "B-SEXUALITY",
    "I-SEXUALITY",
    "B-POLITICAL",
    "I-POLITICAL",
    "B-MARITALSTATUS",
    "I-MARITALSTATUS"
  ],
  "toxicity_thresholds": {
    "toxic": 0.9029,
    "severe_toxic": 0.8966,
    "obscene": 0.9394,
    "threat": 0.7783,
    "insult": 0.8721,
    "identity_hate": 0.9185
  },
  "input_shape": [1, 512],
  "input_desc": "one UTF-8 text string, byte tokenized to [CLS] b0 b1 ... truncated to max_len, int64 ids in [0,258]",
  "head_thresholds": {
    "spam": {
      "spam": 0.97,
      "scam": 0.97,
      "phishing": 0.97
    }
  }
}
